---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.Set2DContextHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/675a5b9e-9fa2-9dca-46c1-214197226adf.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.Set2DContextHandle Method

Sets the IfcRepresentationContext handle to be used for 2D entities (Annotations).

## Syntax (C#)
```csharp
public void Set2DContextHandle(
	IFCAnyHandle contextHandle
)
```

## Parameters
- **contextHandle** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The IfcRepresentationContext.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null